loloLR17/MSM_vibe/Modbus RTU/05_Firmware/platform/stm32/stm32u5xx_hal_conf.h
#ifndef STM32U5XX_HAL_CONF_H
#define STM32U5XX_HAL_CONF_H

#define HAL_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED

#define HSE_VALUE             16000000U
#define HSE_STARTUP_TIMEOUT   100U
#define MSI_VALUE              4000000U
#define HSI_VALUE             16000000U
#define LSI_VALUE                32000U
#define LSE_VALUE                32768U
#define LSE_STARTUP_TIMEOUT  5000U
#define EXTERNAL_CLOCK_VALUE 12288000U

#define VDD_VALUE               3300U
#define TICK_INT_PRIORITY       0x0FU
#define USE_RTOS                0U
#define PREFETCH_ENABLE         0U

#include "stm32u5xx_hal_rcc.h"
#include "stm32u5xx_hal_gpio.h"
#include "stm32u5xx_hal_cortex.h"
#include "stm32u5xx_hal_pwr.h"

#ifdef USE_FULL_ASSERT
void assert_failed(uint8_t *file, uint32_t line);
#endif

#endif
